     H AlwNull(*UsrCtl)

     D ZZSIMP          PR                  ExtPgm('ZZSIMP')
     D  HEXHND                       64
     D  DBID                          2
     D  SPPGID                       10
     D  SPOP01                        1
     D  SPOP02                        1
     D  SPOP03                        1
     D  SPOP04                        1
     D  SPOP05                        1
     D  SPOP06                        1
     D  SPOP07                        1
     D  SPOP08                        1
     D  SPOP09                        1
     D  SPOP10                        1
     D  SPOP11                        1
     D  SPOP12                        1
     D  SPOP13                        1
     D  SPOP14                        1
     D  SPOP15                        1


     D ZZSIMP          PI
     D  HEXHND                       64
     D  DBID                          2
     D  SPPGID                       10
     D  SPOP01                        1
     D  SPOP02                        1
     D  SPOP03                        1
     D  SPOP04                        1
     D  SPOP05                        1
     D  SPOP06                        1
     D  SPOP07                        1
     D  SPOP08                        1
     D  SPOP09                        1
     D  SPOP10                        1
     D  SPOP11                        1
     D  SPOP12                        1
     D  SPOP13                        1
     D  SPOP14                        1
     D  SPOP15                        1
      /free
       return;
      /end-free

